package Day02;

public class OperExample {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		p("********************************");
		p("Operation Test");
		p("********************************");
		
		// 1. 대입연산
		int num = 10;
		p("1.num(=) " + num);
		p("********************************");
		
		// 2. 대입연산2
		num += 10;
		p("2-1.num(+=) " + num);
		num -= 10;
		p("2-2.num(-=) " + num);
		p("********************************");
		
		// 3. 대입연산3
		num *= 10;
		p("3-1.num(*=) " + num);
		p("3-2.num(*=) " + (num*=10));
		p("3-3.num() " + num);
		p("********************************");
		
		// 4. 산술연산
		num = 5 + 5 * 2;
		p("4-1. 5 + 5 * 2 = " + num);
		num = 5 * (5 + 2);
		p("4-2. 5 * (5 + 2) = " + num);
		int num_of_grp = 3;
		num = 35 % num_of_grp;
		p("4-3. 35 % 3 = " + num);
		p("********************************");
		
		// 5. 나누기
		num = 10 / 4;
		p("5. 10 / 4 = " + num);
	    // num = 10. / 4;  // 실수를 int에 넣을 수 없음
		float num_f = (float)10.0 / 4;  // 소수점 수는 double로 인식
		p("********************************");
		
		// 6. 0으로 나눠보기
		//num = 10 / 0;
		
		// 7. 증감연산
		int a = 10;
		int b = 10;
		a++;
		++b;
		p("7-1. a++, ++b -> " + a + " " + b);
		int x = a++;
		int y = ++b;
		p("7-2. a++, ++b -> " + x + " " + y);
		p("********************************");
		
		// 8. 비교연산
		a = 10; b = 5;
		p("8-1. 10 > 5 : " + (a>b));
		p("8-2. 10 < 5 : " + (a<b));
		p("8-3. 10 == 5 : " + (a==b));
		p("8-4. 10 != 5 : " + (a!=b));
		p("8-5. 'a' > 'b' : " + ('a'>'b'));
		p("********************************");
	}
	
	public static void p(String str) {
		System.out.println(str);
	}

}